In [1]:
import pandas as pd

In [2]:
df_details= pd.read_csv('C:/Users/sahil/Downloads/Details.csv')

In [3]:
df_details.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [4]:
df_details.rename(columns = {'Order ID':'Order_ID'},inplace=True)

In [5]:
df_details.head()

,Order_ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [6]:
df_details.isnull().sum()

Order_ID        0
Amount          0
Profit          0
Quantity        0
Category        0
Sub-Category    0
PaymentMode     0
dtype: int64

In [7]:
df_details.dtypes

Order_ID        object
Amount           int64
Profit           int64
Quantity         int64
Category        object
Sub-Category    object
PaymentMode     object
dtype: object

In [9]:
df_orders = pd.read_csv('C:/Users/sahil/Downloads/Orders.csv')

In [10]:
df_orders.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [11]:
df_orders.rename(columns = {'Order ID':'Order_ID','Order Date':'Order_Date'},inplace=True)

In [12]:
df_orders.head()

  Order_ID  Order_Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [13]:
df_orders.isnull().sum()

Order_ID        0
Order_Date      0
CustomerName    0
State           0
City            0
dtype: int64

In [17]:
df_details.rename(columns = {'Sub-Category':'Sub_Category'},inplace =True)

In [18]:
df_orders.to_csv('Orders.csv')

In [19]:
df_details.to_csv('Details.csv')